# С символа # начинается комментарий.
# Питон игнорирует все комментарии

# В питоне существуют три типа конструкций:
# Переменные, выражения и ключевые слова

# Переменная - это коробка, в которой лежат объекты

# int => (integer) целое число
a = 123
# float => (floating point number) дробное число
a = 3.14
# str => (string) строчка
a = "Hello"
# list => список
a = [1, 20, 300]

# Можно получить из ввода одну строку вот так:
a = input("Введите строку: ")

# Можно получить одно число из ввода так:
a = int(input("Введите число: "))

# Чтобы получить несколько чисел из одной строки:
a, b, c = map(int, input("Введите три числа через пробел: ").split())
# Чтобы ввести несколько значений и несколько из них сделать числами:
a, b, c = input("Введите три числа через пробел: ").split()
a = int(a)
b = int(b)

# Чтобы выводить, используй функцию print:
print(a, b, c)
# После каждого вызова print() будет перенос строки.
# Можно указать что выводить после print() вот так:
print(a, b, end=' ')
# В конце выведется пробел и не будет переноса строки.
# Если написать пустой print(), то произойдёт перенос строки:
print()

# Чтобы повторить одно и то же действие несколько раз
# исользуют циклы. Например, цикл for, который
# повторяет одно действие 10 раз:
for i in range(10):
    print(i, end=' ')
print()

# Массив - это список чисел. Они нумеруются с нуля.
# Чтобы прочитать массив, используй:
arr = list(map(int, input("Введите несколько чисел через пробел: ").split()))

# Цикл for можно использовать вместе с массивами:
for num in arr:
    # Для очередного числа в массиве выводим его:
    print(num, end=' ')
print()

# Арифметические операции работают также, как в математике:
print(5 + 4 * 3)
# В питоне различают целочисленное деление. Оно округляет вниз
print(5 // 3)
# И дробное. Оно получает десятичную дробь:
print(5 / 3)

# Чтобы проверить какое-то условие, используют if.
# Чтобы проверить, что число делится на другое
# используют символ % остаток от деления:
num = int(input("Введите число: "))
if num % 2 == 0:
    # Два символа "равно" == обозначают проверку на равенство
    print("Число чётное")

# if можно писать так:
if num % 3 == 0:
    print("Число делится на 3")
else:
    print("Число не делится на 3")

# И даже так:
if num % 10 == 0:
    print("Число заканчивается на 0")
elif num % 10 == 5:
    print("Число заканчивается на 5")
elif num % 10 == 7:
    print("Число заканчивается на 7")
else:
    print("Число не заканчивается ни на 0, ни на 5, ни на 7")

# Циклы можно вкладывать друг в друга:
print("Таблица умножения:")
for i in range(10):
  for j in range(10):
    print(i * j, end=' ')
  print()
